/** 심볼형
 * 자바스크립트는 객체 프로퍼티 키로 오직 문자형과 심볼형만을 허용한다.
 * 숫자형, 불린형 모두 불가능하고 오직 문자형과 심볼형만 가능하다.
 * 
 ** 심볼
 * '심볼(symbol)'은 유일한 식별자(unique identifier)를 만들고 싶을 때 사용한다.
 * Symbol()을 사용하면 심볼값을 만들 수 있다.
 */

// id는 새로운 심볼이 된다.
let id = Symbol();

// 심볼을 만들 때 심볼 이름이라는 불리는 설명을 붙일 수도 있다. 심볼 이름은 디버깅 할 때 아주 유용하다.

// 심볼 id에는 "id"라는 설명이 붙는다.
let idOther = Symbol("id");

/**
 * 심볼은 유일성이 보장되는 자료형이기 때문에, 설명이 동일한 심볼을 여러 개 만들어도 각 심볼값은 다르다
 * 심볼에 붙이는 설명(심볼 이름)은 어떤 것에도 영향을 주지 않는 이름표 역할만 한다.
 */

let id1 = Symbol("id");
let id2 = Symbol("id");

alert(id1 == id2); // false

/*
 * 참고로 Ruby 등의 언어에서도 '심볼'과 유사한 개념을 사용하는데, 
 * 자바스크립트의 심볼은 이들 언어에 쓰이는 심볼과 다르기 때문에 혼동하지 말자.
 * 
 ** 심볼은 문자형으로 자동으로 형 변환되지 않는다.
 * 자바스크립트에선 문자형으로 암시적 형 변환이 비교적 자유롭게 일어나는 편이다.
 * alert 함수가 거의 모든 값을 인자로 받을 수 있는 이유가 바로 이 때문이다.
 * 그러나 심볼은 예외다. 심볼형 값은 다른 자료형으로 암시적 형 변환(자동 형 변환)되지 않는다.
 * 
 * let id = Symbol("id");
 * alert(id); // TypeError: Cannot convert a Symbol value to a string
 * 
 * 문자열과 심볼은 근본이 다르기 때문에 우연히라도 서로의 타입으로 변환돼선 안된다.
 * 자바스크립트에선 '언어 차원의 보호장치(language guard)'를 마련해 심볼형이 다른 형으로 변환되지 않게 막아준다.
 * 심볼을 반드시 출력해줘야 하는 상황이라면 .toString() 메서드를 명시적으로 호출해주면 된다.
 * 
 * let id = Symbol("id");
 * alert(id.toString()); // Symbol(id)가 얼럿 창에 출력됨
 * 
 * symbol.description 프로퍼티를 이용하면 설명만 보여주는 것도 가능하다.
 * 
 * let id = Symbol("id");
 * alert(id.description); // id
 */

////////

/** '숨김' 프로퍼티
 * 심볼을 이용하면 '숨김(hidden)'프로퍼티를 만들 수 있다.
 * 숨김 프로퍼티는 외부 코드에서 접근이 불가능하고 값도 덮어쓸 수 없는 프로퍼티이다.
 */
let user = { // 서드파티 코드에서 가져온 객체
    name: "John"
};

let ID = Symbol("ID");

user[ID] = 1;

alert(user[ID]);

/** 문자열 "ID'를 사용하지 않고 Symbol("ID")을 사용한 이유
 * user는 서드파티 코드에서 가지고 온 객체이므로 함부로 새로운 프로퍼티를 추가할 수 없다.
 * 그런데 심볼은 서드파티 코드에서 접근할 수 없기 때문에, 심볼을 사용하면 서드파티 코드가 모르게 user에 식별자를 부여할 수 있다.
 * 
 * 만약, 제3의 스크립트(자바스크립트 라이브러리 등)에서 user를 식별해야 하는 상황이 벌어졌다고 가정해보자
 * user의 원천인 서드파티 코드, 현재 작성 중인 스크립트, 제3의 스크립트가 각자 서로 코드도 모른 채 user를 식별해야하는 상황이 벌어진다면
 * 제3의 스크립트에선 다음과 같이 Symbol("ID")을 이용해 전용 식별자를 만들어 사용할 수 있다.
 * 
 * //...
 * let ID = Symbol("ID");
 * 
 * user[ID] = "제3 스크립트 ID 값";
 * 
 * 심볼은 유일성이 보장되므로 우리가 만든 식별자와 제3의 스크립트에서 만든 식별자가 충돌하지 않는다. 이름이 같음에 불구하고.
 * 만약 심볼 대신 문자열"ID"를 사용해 식별자를 만들었다면 충돌이 발생할 수 있다.
 */

///////

/** Symbol in a literal
 * 객체 리터럴 {...}을 사용해 객체를 만든 경우, 대괄호를 사용해 심볼형 키를 만들어야 한다.
 */

let userOther = {
    name: "John",
    [id]: 123 // "id": 123은 안됨
};
/* "id": 123"이라고 하면, 심볼 id가 아니라 문자열 "id"가 된다. */

//////

/** 심볼은 for...in에서 배제된다.
 * 키가 심볼인 프로퍼티는 for..in 반복문에서 배제 된다.
 */

let idA = Symbol("id");
let userA = {
    name: "John",
    age: 30,
    [idA]: 123
};

for (let key in userA) alert(key); // name과 age만 출력되고, 심볼은 출력되지 않는다.

// 심볼로 직접 접근하면 잘 작동 된다.
alert("직접 접근한 값:" + userA[idA]);
/**
 * Object.keys(userA)에서도 키가 심볼인 프로퍼티는 배제된다. 
 * '심볼형 프로퍼티 숨기기(hiding symbolic property)'라 불리는 이런 원칙 덕분에 외부 스크립트나 라이브러리는 심볼형 키를 가진 프로퍼티에 접근 못한다.
 * 
 * 그런데 Object.assign은 키가 심볼인 프로퍼티를 배제하지 않고 객체 내 모든 프로퍼티를 복사한다.
 */

let clone = Object.assign([], userA);

alert(clone[idA]); // 123
/**
 * 모순이 있어 보이지만, 의도적으로 설계된 것이라고 한다.
 * 객체를 복사하거나 병합 할때 대개 심볼을 포함한 프로퍼티 전부를 사용하고 싶어 할 것이라는 생각에서 설계되었다고 한다.
 */

////

/** 전역 심볼
 * 앞선 심볼들은 이름이 같더라도 모두 별개로 취급되었다. 그런데 이름이 같은 심볼이 같은 개체를 가리키길 원하는 경우도 가끔 있다.
 * 이런 경우를 위해 전역 심볼 레지스트리(global symbol registry)가 만들어 졌다.
 * 전역 심볼 레지스트리 안에 심볼을 만들고 해당 심볼에 접근하면, 이름이 같을 경우 항상 동일한 심볼을 반환한다.
 * 
 * 레지스트리 안에 있는 심볼을 읽거나, 새로운 심볼을 생성하려면 Symbol.for(key)를 사용하면 된다.
 * 
 * 이 메서드를 호출하면 이름이 key인 심볼을 반환한다. 조건에 맞는 심볼이 레지스트리 안에 없으면 새로운 심볼을 만들고 레지스트리 안에 저장한다.
 */

// 전역 레지스트리에서 심볼을 읽는다.
let idGlobal = Symbol.for("id"); // 심볼이 존재하지 않으면 새로운 심볼을 만든다.

// 동일한 이름을 이용해 심볼을 다시 읽는다 (좀 더 멀리 떨어진 코드에서도 가능)
let idAgain = Symbol.for("id");

// 두 심볼은 같다.
alert(idGlobal === idAgain); // true
/**
 * 전역 심볼 레지스트리 안에 있는 심볼은 전역 심볼이라고 불린다.
 * 애플리케이션에서 광범위하게 사용해야 하는 심볼이라면 전역 심볼을 사용하자.
 * 
 * Ruby 등의 몇몇 언어에선 이름이 같으면 심볼도 같다.
 * 자바스크립트에선 전역 심볼에만 이런 특징을 갖는다.
 */

/////

/** Symbol.keyFor
 * 전역 심볼을 찾을 때 사용되는 Symbol.for(key)에 반대되는 메서드도 있다.
 * Symbol.keyFor(sym)를 사용하면 이름을 얻을 수 있다.
 */

// 이름을 이용해 심볼을 찾음
let sym = Symbol.for("name");
let sym2 = Symbol.for("id");

// 심볼을 이용해 이름을 얻음
alert(Symbol.keyFor(sym)); // name
alert(Symbol.keyFor(sym2)); // id
/**
 * Symbol.keyFor는 전역 심볼 레지스트리를 뒤져서 해당 심볼의 이름을 얻에 낸다.
 * 검색 범위가 전역 심볼 레지스트리이기 때문에 전역 심볼이 아닌 심볼에는 사용 할 수 없다
 * 전역 심볼이 아닌 인자가 넘어오면 undefined를 반환한다.
 * 
 * 전역 심볼이 아닌 모든 심볼은 description 프로퍼티가 있으므로 일반 심볼에서 이름을 얻고 싶으면 description 프로퍼티를 사용하면 된다.
 */

let globalSymbol = Symbol.for("name");
let localSymbol = Symbol("name");

alert(Symbol.keyFor(globalSymbol)); // name, 전역 심볼
alert(Symbol.keyFor(localSymbol)); // undefined, 전역 심볼 아님

alert(localSymbol.description); // name

/////

/** 시스템 심볼
 * '시스템 심볼(system symbol)'은 자바스크립트 내부에서 사용되는 심볼이다. 시스템 심볼을 활용하면 객체를 미세 조정 할 수 있다.
 * 명세서 내의 표, 잘 알려진 심볼(well-known symbol)에서 어떤 시스템 심볼이 있는지 살펴보면 된다.
 * 
 * Symbol.hasInstance
 * Symbol.isConcatSpreadable
 * Symbol.iterator
 * Symbol.toPrimitive
 * 기타 등등
 * 
 * 객체가 어떻게 원시형으로 변환되는지 알기 위해선 Symbol.toPrimitive에 대해 알아야한다.
 * 
 *****
 * Symbol은 원시형 데이터로, 유일무이한 식별자를 만드는데 사용
 * Symbol()을 호출하면 심볼을 만들 수 있으며, 설명(이름)은 선택적으로 추가할 수 있다.
 * 
 * 심볼을 주요 사용하는 케이스는
 * 1. 객체의 '숨김' 프로퍼티를 사용하기 위해
 * 2. 자바스크립트 내부에서 사용되는 시스템 심볼을 Symbol.*로 접근 가능. 시스템 심볼을 이용하면 내장 메서드 등을 기본 동작을 입맛대로 변경하기 위해
 * 
 * 사실 심볼을 완전히 숨길 방법은 없다. 내장 메서드 Object.getOwnPropertySymbols(obj)를 사용하면 모든 심볼을 볼 수 있고,
 * 메서드 Reflect.ownKeys(obj)는 심볼형 키를 포함한 객체의 모든 키를 반환해준다. 
 * 그런데 대부븐의 라이브러리, 내장 함수 등은 이런 메서드를 사용하지 않는다.
 * 
 */

